zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/clock/hpm67xx_64xx-clocks.h
/*
 * Copyright (c) 2022 HPMicro
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPMICRO_CLOCKS_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPMICRO_CLOCKS_H_

#include "hpmicro-clocks-common.h"

/**
 * @brief resource definitions
 */
#define SYSCTL_RESOURCE_CPU0             (0U)
#define SYSCTL_RESOURCE_CPX0             (1U)
#define SYSCTL_RESOURCE_EXE0             (2U)
#define SYSCTL_RESOURCE_WAK0             (3U)
#define SYSCTL_RESOURCE_CPU0_PER         (4U)
#define SYSCTL_RESOURCE_CPU1             (8U)
#define SYSCTL_RESOURCE_CPX1             (9U)
#define SYSCTL_RESOURCE_EXE1             (10U)
#define SYSCTL_RESOURCE_WAK1             (11U)
#define SYSCTL_RESOURCE_CPU1_PER         (12U)
#define SYSCTL_RESOURCE_LOGIC0           (16U)
#define SYSCTL_RESOURCE_LOGIC1           (17U)
#define SYSCTL_RESOURCE_LOGIC2           (18U)
#define SYSCTL_RESOURCE_LOGIC3           (19U)
#define SYSCTL_RESOURCE_PMIC             (20U)
#define SYSCTL_RESOURCE_POW_CON          (21U)
#define SYSCTL_RESOURCE_POW_VIS          (22U)
#define SYSCTL_RESOURCE_POW_CPU0         (23U)
#define SYSCTL_RESOURCE_POW_CPU1         (24U)
#define SYSCTL_RESOURCE_RST_SOC          (25U)
#define SYSCTL_RESOURCE_RST_CON          (26U)
#define SYSCTL_RESOURCE_RST_VIS          (27U)
#define SYSCTL_RESOURCE_RST_CPU0         (28U)
#define SYSCTL_RESOURCE_RST_CPU1         (29U)
#define SYSCTL_RESOURCE_XTAL             (32U)
#define SYSCTL_RESOURCE_PLL0             (33U)
#define SYSCTL_RESOURCE_CLK0_PLL0        (34U)
#define SYSCTL_RESOURCE_PLL1             (35U)
#define SYSCTL_RESOURCE_CLK0_PLL1        (36U)
#define SYSCTL_RESOURCE_CLK1_PLL1        (37U)
#define SYSCTL_RESOURCE_PLL2             (38U)
#define SYSCTL_RESOURCE_CLK0_PLL2        (39U)
#define SYSCTL_RESOURCE_CLK1_PLL2        (40U)
#define SYSCTL_RESOURCE_PLL3             (41U)
#define SYSCTL_RESOURCE_CLK0_PLL3        (42U)
#define SYSCTL_RESOURCE_PLL4             (43U)
#define SYSCTL_RESOURCE_CLK0_PLL4        (44U)
#define SYSCTL_RESOURCE_MBIST_SOC        (48U)
#define SYSCTL_RESOURCE_MBIST_CPU        (49U)
#define SYSCTL_RESOURCE_MBIST_CPU1       (50U)
#define SYSCTL_RESOURCE_MBIST_CON        (51U)
#define SYSCTL_RESOURCE_MBIST_VIS        (52U)
#define SYSCTL_RESOURCE_CLK_TOP_CPU0     (64U)
#define SYSCTL_RESOURCE_CLK_TOP_MCHTMR0  (65U)
#define SYSCTL_RESOURCE_CLK_TOP_CPU1     (66U)
#define SYSCTL_RESOURCE_CLK_TOP_MCHTMR1  (67U)
#define SYSCTL_RESOURCE_CLK_TOP_AXI0     (68U)
#define SYSCTL_RESOURCE_CLK_TOP_AXI1     (69U)
#define SYSCTL_RESOURCE_CLK_TOP_AXI2     (70U)
#define SYSCTL_RESOURCE_CLK_TOP_AHB0     (71U)
#define SYSCTL_RESOURCE_CLK_TOP_FEMC     (72U)
#define SYSCTL_RESOURCE_CLK_TOP_XPI0     (73U)
#define SYSCTL_RESOURCE_CLK_TOP_XPI1     (74U)
#define SYSCTL_RESOURCE_CLK_TOP_GPTMR0   (75U)
#define SYSCTL_RESOURCE_CLK_TOP_GPTMR1   (76U)
#define SYSCTL_RESOURCE_CLK_TOP_GPTMR2   (77U)
#define SYSCTL_RESOURCE_CLK_TOP_GPTMR3   (78U)
#define SYSCTL_RESOURCE_CLK_TOP_GPTMR4   (79U)
#define SYSCTL_RESOURCE_CLK_TOP_GPTMR5   (80U)
#define SYSCTL_RESOURCE_CLK_TOP_GPTMR6   (81U)
#define SYSCTL_RESOURCE_CLK_TOP_GPTMR7   (82U)
#define SYSCTL_RESOURCE_CLK_TOP_UART0    (83U)
#define SYSCTL_RESOURCE_CLK_TOP_UART1    (84U)
#define SYSCTL_RESOURCE_CLK_TOP_UART2    (85U)
#define SYSCTL_RESOURCE_CLK_TOP_UART3    (86U)
#define SYSCTL_RESOURCE_CLK_TOP_UART4    (87U)
#define SYSCTL_RESOURCE_CLK_TOP_UART5    (88U)
#define SYSCTL_RESOURCE_CLK_TOP_UART6    (89U)
#define SYSCTL_RESOURCE_CLK_TOP_UART7    (90U)
#define SYSCTL_RESOURCE_CLK_TOP_UART8    (91U)
#define SYSCTL_RESOURCE_CLK_TOP_UART9    (92U)
#define SYSCTL_RESOURCE_CLK_TOP_UARTA    (93U)
#define SYSCTL_RESOURCE_CLK_TOP_UARTB    (94U)
#define SYSCTL_RESOURCE_CLK_TOP_UARTC    (95U)
#define SYSCTL_RESOURCE_CLK_TOP_UARTD    (96U)
#define SYSCTL_RESOURCE_CLK_TOP_UARTE    (97U)
#define SYSCTL_RESOURCE_CLK_TOP_UARTF    (98U)
#define SYSCTL_RESOURCE_CLK_TOP_I2C0     (99U)
#define SYSCTL_RESOURCE_CLK_TOP_I2C1     (100U)
#define SYSCTL_RESOURCE_CLK_TOP_I2C2     (101U)
#define SYSCTL_RESOURCE_CLK_TOP_I2C3     (102U)
#define SYSCTL_RESOURCE_CLK_TOP_SPI0     (103U)
#define SYSCTL_RESOURCE_CLK_TOP_SPI1     (104U)
#define SYSCTL_RESOURCE_CLK_TOP_SPI2     (105U)
#define SYSCTL_RESOURCE_CLK_TOP_SPI3     (106U)
#define SYSCTL_RESOURCE_CLK_TOP_CAN0     (107U)
#define SYSCTL_RESOURCE_CLK_TOP_CAN1     (108U)
#define SYSCTL_RESOURCE_CLK_TOP_CAN2     (109U)
#define SYSCTL_RESOURCE_CLK_TOP_CAN3     (110U)
#define SYSCTL_RESOURCE_CLK_TOP_PTPC     (111U)
#define SYSCTL_RESOURCE_CLK_TOP_ANA0     (112U)
#define SYSCTL_RESOURCE_CLK_TOP_ANA1     (113U)
#define SYSCTL_RESOURCE_CLK_TOP_ANA2     (114U)
#define SYSCTL_RESOURCE_CLK_TOP_AUD0     (115U)
#define SYSCTL_RESOURCE_CLK_TOP_AUD1     (116U)
#define SYSCTL_RESOURCE_CLK_TOP_AUD2     (117U)
#define SYSCTL_RESOURCE_CLK_TOP_DIS0     (118U)
#define SYSCTL_RESOURCE_CLK_TOP_CAM0     (119U)
#define SYSCTL_RESOURCE_CLK_TOP_CAM1     (120U)
#define SYSCTL_RESOURCE_CLK_TOP_ETH0     (121U)
#define SYSCTL_RESOURCE_CLK_TOP_ETH1     (122U)
#define SYSCTL_RESOURCE_CLK_TOP_PTP0     (123U)
#define SYSCTL_RESOURCE_CLK_TOP_PTP1     (124U)
#define SYSCTL_RESOURCE_CLK_TOP_REF0     (125U)
#define SYSCTL_RESOURCE_CLK_TOP_REF1     (126U)
#define SYSCTL_RESOURCE_CLK_TOP_NTMR0    (127U)
#define SYSCTL_RESOURCE_CLK_TOP_NTMR1    (128U)
#define SYSCTL_RESOURCE_CLK_TOP_SDXC0    (129U)
#define SYSCTL_RESOURCE_CLK_TOP_SDXC1    (130U)
#define SYSCTL_RESOURCE_CLK_TOP_ADC0     (192U)
#define SYSCTL_RESOURCE_CLK_TOP_ADC1     (193U)
#define SYSCTL_RESOURCE_CLK_TOP_ADC2     (194U)
#define SYSCTL_RESOURCE_CLK_TOP_ADC3     (195U)
#define SYSCTL_RESOURCE_CLK_TOP_I2S0     (196U)
#define SYSCTL_RESOURCE_CLK_TOP_I2S1     (197U)
#define SYSCTL_RESOURCE_CLK_TOP_I2S2     (198U)
#define SYSCTL_RESOURCE_CLK_TOP_I2S3     (199U)
#define SYSCTL_RESOURCE_LINKABLE_START   (256U)
#define SYSCTL_RESOURCE_AHBP             (256U)
#define SYSCTL_RESOURCE_AXIS             (257U)
#define SYSCTL_RESOURCE_AXIC             (258U)
#define SYSCTL_RESOURCE_AXIV             (259U)
#define SYSCTL_RESOURCE_FEMC             (260U)
#define SYSCTL_RESOURCE_ROM0             (261U)
#define SYSCTL_RESOURCE_LMM0             (262U)
#define SYSCTL_RESOURCE_LMM1             (263U)
#define SYSCTL_RESOURCE_MCHTMR0          (264U)
#define SYSCTL_RESOURCE_MCHTMR1          (265U)
#define SYSCTL_RESOURCE_RAM0             (266U)
#define SYSCTL_RESOURCE_RAM1             (267U)
#define SYSCTL_RESOURCE_XPI0             (268U)
#define SYSCTL_RESOURCE_XPI1             (269U)
#define SYSCTL_RESOURCE_SDP0             (270U)
#define SYSCTL_RESOURCE_RNG0             (271U)
#define SYSCTL_RESOURCE_KMAN             (272U)
#define SYSCTL_RESOURCE_DMA0             (273U)
#define SYSCTL_RESOURCE_DMA1             (274U)
#define SYSCTL_RESOURCE_GPIO             (275U)
#define SYSCTL_RESOURCE_MBX0             (276U)
#define SYSCTL_RESOURCE_MBX1             (277U)
#define SYSCTL_RESOURCE_WDG0             (278U)
#define SYSCTL_RESOURCE_WDG1             (279U)
#define SYSCTL_RESOURCE_WDG2             (280U)
#define SYSCTL_RESOURCE_WDG3             (281U)
#define SYSCTL_RESOURCE_GPTMR0           (282U)
#define SYSCTL_RESOURCE_GPTMR1           (283U)
#define SYSCTL_RESOURCE_GPTMR2           (284U)
#define SYSCTL_RESOURCE_GPTMR3           (285U)
#define SYSCTL_RESOURCE_GPTMR4           (286U)
#define SYSCTL_RESOURCE_GPTMR5           (287U)
#define SYSCTL_RESOURCE_GPTMR6           (288U)
#define SYSCTL_RESOURCE_GPTMR7           (289U)
#define SYSCTL_RESOURCE_UART0            (290U)
#define SYSCTL_RESOURCE_UART1            (291U)
#define SYSCTL_RESOURCE_UART2            (292U)
#define SYSCTL_RESOURCE_UART3            (293U)
#define SYSCTL_RESOURCE_UART4            (294U)
#define SYSCTL_RESOURCE_UART5            (295U)
#define SYSCTL_RESOURCE_UART6            (296U)
#define SYSCTL_RESOURCE_UART7            (297U)
#define SYSCTL_RESOURCE_UART8            (298U)
#define SYSCTL_RESOURCE_UART9            (299U)
#define SYSCTL_RESOURCE_UARTA            (300U)
#define SYSCTL_RESOURCE_UARTB            (301U)
#define SYSCTL_RESOURCE_UARTC            (302U)
#define SYSCTL_RESOURCE_UARTD            (303U)
#define SYSCTL_RESOURCE_UARTE            (304U)
#define SYSCTL_RESOURCE_UARTF            (305U)
#define SYSCTL_RESOURCE_I2C0             (306U)
#define SYSCTL_RESOURCE_I2C1             (307U)
#define SYSCTL_RESOURCE_I2C2             (308U)
#define SYSCTL_RESOURCE_I2C3             (309U)
#define SYSCTL_RESOURCE_SPI0             (310U)
#define SYSCTL_RESOURCE_SPI1             (311U)
#define SYSCTL_RESOURCE_SPI2             (312U)
#define SYSCTL_RESOURCE_SPI3             (313U)
#define SYSCTL_RESOURCE_CAN0             (314U)
#define SYSCTL_RESOURCE_CAN1             (315U)
#define SYSCTL_RESOURCE_CAN2             (316U)
#define SYSCTL_RESOURCE_CAN3             (317U)
#define SYSCTL_RESOURCE_PTPC             (318U)
#define SYSCTL_RESOURCE_ADC0             (319U)
#define SYSCTL_RESOURCE_ADC1             (320U)
#define SYSCTL_RESOURCE_ADC2             (321U)
#define SYSCTL_RESOURCE_ADC3             (322U)
#define SYSCTL_RESOURCE_ACMP             (323U)
#define SYSCTL_RESOURCE_I2S0             (324U)
#define SYSCTL_RESOURCE_I2S1             (325U)
#define SYSCTL_RESOURCE_I2S2             (326U)
#define SYSCTL_RESOURCE_I2S3             (327U)
#define SYSCTL_RESOURCE_I2SPDM0          (328U)
#define SYSCTL_RESOURCE_I2SDAO           (329U)
#define SYSCTL_RESOURCE_MSYN             (330U)
#define SYSCTL_RESOURCE_MOT0             (331U)
#define SYSCTL_RESOURCE_MOT1             (332U)
#define SYSCTL_RESOURCE_MOT2             (333U)
#define SYSCTL_RESOURCE_MOT3             (334U)
#define SYSCTL_RESOURCE_DIS0             (335U)
#define SYSCTL_RESOURCE_CAM0             (336U)
#define SYSCTL_RESOURCE_CAM1             (337U)
#define SYSCTL_RESOURCE_JPEG             (338U)
#define SYSCTL_RESOURCE_PDMA             (339U)
#define SYSCTL_RESOURCE_ETH0             (340U)
#define SYSCTL_RESOURCE_ETH1             (341U)
#define SYSCTL_RESOURCE_NTMR0            (342U)
#define SYSCTL_RESOURCE_NTMR1            (343U)
#define SYSCTL_RESOURCE_SDXC0            (344U)
#define SYSCTL_RESOURCE_SDXC1            (345U)
#define SYSCTL_RESOURCE_USB0             (346U)
#define SYSCTL_RESOURCE_USB1             (347U)
#define SYSCTL_RESOURCE_REF0             (348U)
#define SYSCTL_RESOURCE_REF1             (349U)

/**
 * @brief Clock source group definitions
 */
#define CLOCK_SRC_GROUP_COMMON             (0U)
#define CLOCK_SRC_GROUP_ADC                (1U)
#define CLOCK_SRC_GROUP_I2S                (2U)
#define CLOCK_SRC_GROUP_WDG                (3U)
#define CLOCK_SRC_GROUP_PMIC               (4U)
#define CLOCK_SRC_GROUP_AHB                (5U)
#define CLOCK_SRC_GROUP_AXI0               (6U)
#define CLOCK_SRC_GROUP_AXI1               (7U)
#define CLOCK_SRC_GROUP_AXI2               (8U)
#define CLOCK_SRC_GROUP_CPU0               (9U)
#define CLOCK_SRC_GROUP_CPU1               (10U)
#define CLOCK_SRC_GROUP_SRC                (11U)
#define CLOCK_SRC_GROUP_PWDG               (12U)

/**
 * @brief Clock name definitions
 */
#define CLOCK_CPU0    MAKE_CLOCK_NAME(CPU0,    COMMON, 0)
#define CLOCK_MCHTMR0 MAKE_CLOCK_NAME(MCHTMR0, COMMON, 1)
#define CLOCK_CPU1    MAKE_CLOCK_NAME(CPU1,    COMMON, 2)
#define CLOCK_MCHTMR1 MAKE_CLOCK_NAME(MCHTMR1, COMMON, 3)
#define CLOCK_AXI0    MAKE_CLOCK_NAME(AXIS,    COMMON, 4)
#define CLOCK_AXI1    MAKE_CLOCK_NAME(AXIC,    COMMON, 5)
#define CLOCK_AXI2    MAKE_CLOCK_NAME(AXIV,    COMMON, 6)
#define CLOCK_AHB     MAKE_CLOCK_NAME(AHBP,    COMMON, 7)
#define CLOCK_FEMC    MAKE_CLOCK_NAME(FEMC,    COMMON, 8)
#define CLOCK_XPI0    MAKE_CLOCK_NAME(XPI0,    COMMON, 9)
#define CLOCK_XPI1    MAKE_CLOCK_NAME(XPI1,    COMMON, 10)
#define CLOCK_GPTMR0  MAKE_CLOCK_NAME(GPTMR0,  COMMON, 11)
#define CLOCK_GPTMR1  MAKE_CLOCK_NAME(GPTMR1,  COMMON, 12)
#define CLOCK_GPTMR2  MAKE_CLOCK_NAME(GPTMR2,  COMMON, 13)
#define CLOCK_GPTMR3  MAKE_CLOCK_NAME(GPTMR3,  COMMON, 14)
#define CLOCK_GPTMR4  MAKE_CLOCK_NAME(GPTMR4,  COMMON, 15)
#define CLOCK_GPTMR5  MAKE_CLOCK_NAME(GPTMR5,  COMMON, 16)
#define CLOCK_GPTMR6  MAKE_CLOCK_NAME(GPTMR6,  COMMON, 17)
#define CLOCK_GPTMR7  MAKE_CLOCK_NAME(GPTMR7,  COMMON, 18)
#define CLOCK_UART0   MAKE_CLOCK_NAME(UART0,   COMMON, 19)
#define CLOCK_UART1   MAKE_CLOCK_NAME(UART1,   COMMON, 20)
#define CLOCK_UART2   MAKE_CLOCK_NAME(UART2,   COMMON, 21)
#define CLOCK_UART3   MAKE_CLOCK_NAME(UART3,   COMMON, 22)
#define CLOCK_UART4   MAKE_CLOCK_NAME(UART4,   COMMON, 23)
#define CLOCK_UART5   MAKE_CLOCK_NAME(UART5,   COMMON, 24)
#define CLOCK_UART6   MAKE_CLOCK_NAME(UART6,   COMMON, 25)
#define CLOCK_UART7   MAKE_CLOCK_NAME(UART7,   COMMON, 26)
#define CLOCK_UART8   MAKE_CLOCK_NAME(UART8,   COMMON, 27)
#define CLOCK_UART9   MAKE_CLOCK_NAME(UART9,   COMMON, 28)
#define CLOCK_UART10  MAKE_CLOCK_NAME(UARTA,   COMMON, 29)
#define CLOCK_UART11  MAKE_CLOCK_NAME(UARTB,   COMMON, 30)
#define CLOCK_UART12  MAKE_CLOCK_NAME(UARTC,   COMMON, 31)
#define CLOCK_UART13  MAKE_CLOCK_NAME(UARTD,   COMMON, 32)
#define CLOCK_UART14  MAKE_CLOCK_NAME(UARTE,   COMMON, 33)
#define CLOCK_UART15  MAKE_CLOCK_NAME(UARTF,   COMMON, 34)
#define CLOCK_I2C0    MAKE_CLOCK_NAME(I2C0,    COMMON, 35)
#define CLOCK_I2C1    MAKE_CLOCK_NAME(I2C1,    COMMON, 36)
#define CLOCK_I2C2    MAKE_CLOCK_NAME(I2C2,    COMMON, 37)
#define CLOCK_I2C3    MAKE_CLOCK_NAME(I2C3,    COMMON, 38)
#define CLOCK_SPI0    MAKE_CLOCK_NAME(SPI0,    COMMON, 39)
#define CLOCK_SPI1    MAKE_CLOCK_NAME(SPI1,    COMMON, 40)
#define CLOCK_SPI2    MAKE_CLOCK_NAME(SPI2,    COMMON, 41)
#define CLOCK_SPI3    MAKE_CLOCK_NAME(SPI3,    COMMON, 42)
#define CLOCK_CAN0    MAKE_CLOCK_NAME(CAN0,    COMMON, 43)
#define CLOCK_CAN1    MAKE_CLOCK_NAME(CAN1,    COMMON, 44)
#define CLOCK_CAN2    MAKE_CLOCK_NAME(CAN2,    COMMON, 45)
#define CLOCK_CAN3    MAKE_CLOCK_NAME(CAN3,    COMMON, 46)
#define CLOCK_PTPC    MAKE_CLOCK_NAME(PTPC,    COMMON, 47)
#define CLOCK_ANA0    MAKE_CLOCK_NAME(INVALID, COMMON, 48)
#define CLOCK_ANA1    MAKE_CLOCK_NAME(INVALID, COMMON, 49)
#define CLOCK_ANA2    MAKE_CLOCK_NAME(INVALID, COMMON, 50)
#define CLOCK_AUD0    MAKE_CLOCK_NAME(INVALID, COMMON, 51)
#define CLOCK_AUD1    MAKE_CLOCK_NAME(INVALID, COMMON, 52)
#define CLOCK_AUD2    MAKE_CLOCK_NAME(INVALID, COMMON, 53)
#define CLOCK_DSI0    MAKE_CLOCK_NAME(DIS0,    COMMON, 54)
#define CLOCK_CAM0    MAKE_CLOCK_NAME(CAM0,    COMMON, 55)
#define CLOCK_CAM1    MAKE_CLOCK_NAME(CAM1,    COMMON, 56)
#define CLOCK_ETH0    MAKE_CLOCK_NAME(ETH0,    COMMON, 57)
#define CLOCK_ETH1    MAKE_CLOCK_NAME(ETH1,    COMMON, 58)
#define CLOCK_PTP0    MAKE_CLOCK_NAME(INVALID, COMMON, 59)
#define CLOCK_PTP1    MAKE_CLOCK_NAME(INVALID, COMMON, 60)
#define CLOCK_REF0    MAKE_CLOCK_NAME(REF0,    COMMON, 61)
#define CLOCK_REF1    MAKE_CLOCK_NAME(REF1,    COMMON, 62)
#define CLOCK_NTMR0   MAKE_CLOCK_NAME(NTMR0,   COMMON, 63)
#define CLOCK_NTMR1   MAKE_CLOCK_NAME(NTMR1,   COMMON, 64)
#define CLOCK_SDXC0   MAKE_CLOCK_NAME(SDXC0,   COMMON, 65)
#define CLOCK_SDXC1   MAKE_CLOCK_NAME(SDXC1,   COMMON, 66)

#define CLOCK_ADC0    MAKE_CLOCK_NAME(ADC0,    ADC,    0)
#define CLOCK_ADC1    MAKE_CLOCK_NAME(ADC1,    ADC,    1)
#define CLOCK_ADC2    MAKE_CLOCK_NAME(ADC2,    ADC,    2)
#define CLOCK_ADC3    MAKE_CLOCK_NAME(ADC3,    ADC,    3)

#define CLOCK_WDG0    MAKE_CLOCK_NAME(WDG0,    WDG,    0)
#define CLOCK_WDG1    MAKE_CLOCK_NAME(WDG1,    WDG,    1)
#define CLOCK_WDG2    MAKE_CLOCK_NAME(WDG2,    WDG,    2)
#define CLOCK_WDG3    MAKE_CLOCK_NAME(WDG3,    WDG,    3)

#define CLOCK_PUART     MAKE_CLOCK_NAME(INVALID,  PMIC, 0)

#define CLOCK_PWDG      MAKE_CLOCK_NAME(INVALID,  PWDG, 0)

#define CLOCK_SDP       MAKE_CLOCK_NAME(SDP0,     AXI0, 0)
#define CLOCK_XDMA      MAKE_CLOCK_NAME(DMA1,     AXI0, 1)
#define CLOCK_ROM       MAKE_CLOCK_NAME(ROM0,     AXI0, 2)
#define CLOCK_RAM0      MAKE_CLOCK_NAME(RAM0,     AXI0, 3)
#define CLOCK_RAM1      MAKE_CLOCK_NAME(RAM1,     AXI0, 4)

#define CLOCK_USB0      MAKE_CLOCK_NAME(USB0,     AXI1, 0)
#define CLOCK_USB1      MAKE_CLOCK_NAME(USB1,     AXI1, 1)
#define CLOCK_JPEG      MAKE_CLOCK_NAME(JPEG,     AXI2, 0)
#define CLOCK_PDMA      MAKE_CLOCK_NAME(PDMA,     AXI2, 1)

#define CLOCK_KMAN      MAKE_CLOCK_NAME(KMAN,     AHB, 0)
#define CLOCK_GPIO      MAKE_CLOCK_NAME(GPIO,     AHB, 1)
#define CLOCK_MBX0      MAKE_CLOCK_NAME(MBX0,     AHB, 2)
#define CLOCK_MBX1      MAKE_CLOCK_NAME(MBX1,     AHB, 3)
#define CLOCK_HDMA      MAKE_CLOCK_NAME(DMA0,     AHB, 4)
#define CLOCK_RNG       MAKE_CLOCK_NAME(RNG0,     AHB, 5)
#define CLOCK_MOT0      MAKE_CLOCK_NAME(MOT0,     AHB, 6)
#define CLOCK_MOT1      MAKE_CLOCK_NAME(MOT1,     AHB, 7)
#define CLOCK_MOT2      MAKE_CLOCK_NAME(MOT2,     AHB, 8)
#define CLOCK_MOT3      MAKE_CLOCK_NAME(MOT3,     AHB, 9)
#define CLOCK_ACMP      MAKE_CLOCK_NAME(ACMP,     AHB, 10)
#define CLOCK_MSYN      MAKE_CLOCK_NAME(MSYN,     AHB, 12)

#define CLOCK_PDM       MAKE_CLOCK_NAME(I2SPDM0,  I2S, 0)
#define CLOCK_DAO       MAKE_CLOCK_NAME(I2SDAO,   I2S, 1)

#define CLOCK_LMM0      MAKE_CLOCK_NAME(LMM0,     CPU0, 0)
#define CLOCK_LMM1      MAKE_CLOCK_NAME(LMM1,     CPU1, 0)

#define CLOCK_I2S0      MAKE_CLOCK_NAME(I2S0,     I2S, 0)
#define CLOCK_I2S1      MAKE_CLOCK_NAME(I2S1,     I2S, 1)
#define CLOCK_I2S2      MAKE_CLOCK_NAME(I2S2,     I2S, 2)
#define CLOCK_I2S3      MAKE_CLOCK_NAME(I2S3,     I2S, 3)

#define CLOCK_OSC0CLK0  MAKE_CLOCK_NAME(INVALID,  SRC, 0)
#define CLOCK_PLL0CLK0  MAKE_CLOCK_NAME(INVALID,  SRC, 1)
#define CLOCK_PLL1CLK0  MAKE_CLOCK_NAME(INVALID,  SRC, 2)
#define CLOCK_PLL1CLK1  MAKE_CLOCK_NAME(INVALID,  SRC, 3)
#define CLOCK_PLL2CLK0  MAKE_CLOCK_NAME(INVALID,  SRC, 4)
#define CLOCK_PLL2CLK1  MAKE_CLOCK_NAME(INVALID,  SRC, 5)
#define CLOCK_PLL3CLK0  MAKE_CLOCK_NAME(INVALID,  SRC, 6)
#define CLOCK_PLL4CLK0  MAKE_CLOCK_NAME(INVALID,  SRC, 7)

/**
 * @brief Clock source definitions
 */

#define CLOCK_SRC_OSC24M       MAKE_CLOCK_SRC(COMMON, 0)
#define CLOCK_SRC_PLL0_CLK0    MAKE_CLOCK_SRC(COMMON, 1)
#define CLOCK_SRC_PLL1_CLK0    MAKE_CLOCK_SRC(COMMON, 2)
#define CLOCK_SRC_PLL1_CLK1    MAKE_CLOCK_SRC(COMMON, 3)
#define CLOCK_SRC_PLL2_CLK0    MAKE_CLOCK_SRC(COMMON, 4)
#define CLOCK_SRC_PLL2_CLK1    MAKE_CLOCK_SRC(COMMON, 5)
#define CLOCK_SRC_PLL3_CLK0    MAKE_CLOCK_SRC(COMMON, 6)
#define CLOCK_SRC_PLL4_CLK0    MAKE_CLOCK_SRC(COMMON, 7)
#define CLOCK_SRC_OSC32K       MAKE_CLOCK_SRC(COMMON, 8)
#define CLOCK_ADC_SRC_AHB0     MAKE_CLOCK_SRC(ADC, 0)
#define CLOCK_ADC_SRC_ANA0     MAKE_CLOCK_SRC(ADC, 1)
#define CLOCK_ADC_SRC_ANA1     MAKE_CLOCK_SRC(ADC, 2)
#define CLOCK_ADC_SRC_ANA2     MAKE_CLOCK_SRC(ADC, 3)
#define CLOCK_I2S_SRC_AHB0     MAKE_CLOCK_SRC(I2S, 0)
#define CLOCK_I2S_SRC_AUD0     MAKE_CLOCK_SRC(I2S, 1)
#define CLOCK_I2S_SRC_AUD1     MAKE_CLOCK_SRC(I2S, 2)
#define CLOCK_I2S_SRC_AUD2     MAKE_CLOCK_SRC(I2S, 3)
#define CLOCK_WDG_SRC_AHB0     MAKE_CLOCK_SRC(WDG, 0)
#define CLOCK_WDG_SRC_OSC32K   MAKE_CLOCK_SRC(WDG, 1)
#define CLOCK_PWDG_SRC_OSC24M  MAKE_CLOCK_SRC(PWDG, 0)
#define CLOCK_PWDG_SRC_OSC32K  MAKE_CLOCK_SRC(PWDG, 1)
#define CLOCK_SRC_INVALID      MAKE_CLOCK_SRC(INVALID, 15)

#endif
